Quency-D/Heltec_nRF52/boards.txt
HT-mesh-pocket-v2.build.defines=-DLoraWan_RGB={build.rgb_enable} -DLORA_DEBUG_SERIAL_NUM={build.lora_debug} -DLORA_DEBUG_ENABLE={build.LoRa_debug} -DHELTEC_MESH_POCKET_V2
HT-mesh-pocket-v2.build.debug_flags=-DCFG_DEBUG=0

# -----------------------------------
#radiocore_52840
# -----------------------------------
radiocore_52840.name=RadioCore-52840

# VID/PID for Bootloader, Arduino & CircuitPython
radiocore_52840.vid.0=0x239A
radiocore_52840.pid.0=0x8071
radiocore_52840.vid.1=0x239A
radiocore_52840.pid.1=0x0071
radiocore_52840.vid.2=0x239A
radiocore_52840.pid.2=0x8072

# Upload
radiocore_52840.bootloader.tool=bootburn
radiocore_52840.upload.tool=nrfutil
radiocore_52840.upload.protocol=nrfutil
radiocore_52840.upload.use_1200bps_touch=true
radiocore_52840.upload.wait_for_upload_port=true
radiocore_52840.upload.maximum_size=815104
radiocore_52840.upload.maximum_data_size=237568

# Build
radiocore_52840.build.mcu=cortex-m4
radiocore_52840.build.f_cpu=64000000
radiocore_52840.build.board=RADIOCORE_52840
radiocore_52840.build.core=nRF5
radiocore_52840.build.variant=radiocore_52840
radiocore_52840.build.usb_manufacturer="Heltec"
radiocore_52840.build.usb_product="RadioCore-52840"
radiocore_52840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
radiocore_52840.build.ldscript=nrf52840_s140_v6.ld
radiocore_52840.build.openocdscript=scripts/openocd/daplink_nrf52.cfg
radiocore_52840.build.vid=0x239A
radiocore_52840.build.pid=0x8071

# Menu: SoftDevice
radiocore_52840.menu.softdevice.s140v6=S140 6.1.1
radiocore_52840.menu.softdevice.s140v6.build.sd_name=s140
radiocore_52840.menu.softdevice.s140v6.build.sd_version=6.1.1
radiocore_52840.menu.softdevice.s140v6.build.sd_fwid=0x00B6

radiocore_52840.menu.RGB.disable=Disable
radiocore_52840.menu.RGB.disable.build.rgb_enable=0

radiocore_52840.menu.LoRa_debug.enable=Enable
radiocore_52840.menu.LoRa_debug.enable.build.LoRa_debug=1
radiocore_52840.menu.LoRa_debug.disable=Disable
radiocore_52840.menu.LoRa_debug.disable.build.LoRa_debug=0

radiocore_52840.menu.lora_debug_port.serial=Serial(USB CDC)
radiocore_52840.menu.lora_debug_port.serial.build.lora_debug=0
radiocore_52840.menu.lora_debug_port.serial1=Serial1(UART0)
radiocore_52840.menu.lora_debug_port.serial1.build.lora_debug=1

radiocore_52840.build.defines=-DLoraWan_RGB={build.rgb_enable} -DLORA_DEBUG_SERIAL_NUM={build.lora_debug} -DLORA_DEBUG_ENABLE={build.LoRa_debug} -DRADIOCORE_52840
radiocore_52840.build.debug_flags=-DCFG_DEBUG=0
